[
    {
        "term": "Cytoskeleton",
        "definition": "A network of fibers that provides structural support to the cell."
    },
    {
        "term": "Nucleolus",
        "definition": "A small dense region within the nucleus where ribosome assembly begins."
    },
    {
        "term": "Chromatin",
        "definition": "The material of which the chromosomes of organisms are composed."
    },
    {
        "term": "Mitochondrion",
        "definition": "An organelle responsible for energy production in the cell."
    },
    {
        "term": "DNA",
        "definition": "The molecule that carries the genetic information of living organisms."
    },
    {
        "term": "Genome",
        "definition": "The complete set of genetic material in an organism."
    },
    {
        "term": "Photosynthesis",
        "definition": "The process of combining water and carbon dioxide to form carbohydrate and oxygen."
    },
    {
        "term": "Enzyme",
        "definition": "A protein that speeds up chemical reactions in the body."
    },
    {
        "term": "Chloroplast",
        "definition": "An organelle found in plant cells where photosynthesis occurs."
    },
    {
        "term": "Ribosome",
        "definition": "A molecular machine that synthesizes proteins in the cell."
    },
    {
        "term": "Lysosome",
        "definition": "An organelle containing digestive enzymes to break down waste."
    },
    {
        "term": "Cytoplasm",
        "definition": "The jelly-like substance within a cell that contains organelles."
    },
    {
        "term": "Nucleus",
        "definition": "The control center of the cell that contains genetic material."
    },
    {
        "term": "Golgi Apparatus",
        "definition": "An organelle involved in modifying, sorting, and packaging proteins."
    },
    {
        "term": "Endoplasmic Reticulum",
        "definition": "A network of membranes involved in protein and lipid synthesis."
    },
    {
        "term": "ATP",
        "definition": "The energy currency of the cell, produced in mitochondria."
    },
    {
        "term": "Prokaryote",
        "definition": "A single-celled organism without a nucleus."
    },
    {
        "term": "Eukaryote",
        "definition": "An organism whose cells contain a nucleus and organelles."
    }
]